<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#数值运算" data-toc-modified-id="数值运算-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>数值运算</a></span></li><li><span><a href="#逐元素二元运算" data-toc-modified-id="逐元素二元运算-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>逐元素二元运算</a></span><ul class="toc-item"><li><span><a href="#加（+）" data-toc-modified-id="加（+）-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>加（+）</a></span></li><li><span><a href="#.add(-)" data-toc-modified-id=".add(-)-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>.add( )</a></span></li><li><span><a href="#减（-）" data-toc-modified-id="减（-）-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>减（-）</a></span></li><li><span><a href="#其它运算和加法运算类似---减法------sub()" data-toc-modified-id="其它运算和加法运算类似---减法------sub()-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>其它运算和加法运算类似---减法 --   sub()</a></span></li><li><span><a href="#乘（-*--）" data-toc-modified-id="乘（-*--）-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>乘（ *  ）</a></span></li><li><span><a href="#其它运算和加法运算类似--乘法----x----mul()" data-toc-modified-id="其它运算和加法运算类似--乘法----x----mul()-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>其它运算和加法运算类似--乘法    x    mul()</a></span></li><li><span><a href="#除（-/-）" data-toc-modified-id="除（-/-）-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>除（ / ）</a></span></li><li><span><a href="#其它运算和加法运算类似除法----/----div()" data-toc-modified-id="其它运算和加法运算类似除法----/----div()-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>其它运算和加法运算类似除法    /    div()</a></span></li><li><span><a href="#模（-%-）" data-toc-modified-id="模（-%-）-2.9"><span class="toc-item-num">2.9&nbsp;&nbsp;</span>模（ % ）</a></span></li><li><span><a href="#其它运算和加法运算类似模运算----%----mod()" data-toc-modified-id="其它运算和加法运算类似模运算----%----mod()-2.10"><span class="toc-item-num">2.10&nbsp;&nbsp;</span>其它运算和加法运算类似模运算    %    mod()</a></span></li><li><span><a href="#幂运算（-**-）" data-toc-modified-id="幂运算（-**-）-2.11"><span class="toc-item-num">2.11&nbsp;&nbsp;</span>幂运算（ ** ）</a></span></li><li><span><a href="#其它运算和加法运算类似幂运算----**----pow()" data-toc-modified-id="其它运算和加法运算类似幂运算----**----pow()-2.12"><span class="toc-item-num">2.12&nbsp;&nbsp;</span>其它运算和加法运算类似幂运算    **    pow()</a></span></li></ul></li><li><span><a href="#矩阵运算" data-toc-modified-id="矩阵运算-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>矩阵运算</a></span><ul class="toc-item"><li><span><a href="#.dot()" data-toc-modified-id=".dot()-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>.dot()</a></span></li><li><span><a href="#.T" data-toc-modified-id=".T-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>.T</a></span></li></ul></li><li><span><a href="#本地一元变换" data-toc-modified-id="本地一元变换-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>本地一元变换</a></span><ul class="toc-item"><li><span><a href="#.abs()" data-toc-modified-id=".abs()-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>.abs()</a></span></li><li><span><a href="#.cumxxx()" data-toc-modified-id=".cumxxx()-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>.cumxxx()</a></span></li><li><span><a href="#.clip()" data-toc-modified-id=".clip()-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>.clip()</a></span></li><li><span><a href="#.rank()" data-toc-modified-id=".rank()-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>.rank()</a></span></li><li><span><a href="#.round()" data-toc-modified-id=".round()-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>.round()</a></span></li></ul></li></ul></div>

In [28]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## 数值运算

- Series和Series之间的运算
- DataFrame和DataFrame之间的运算
- Series和DataFrame之间的运算
- DataFrame和Series之间的算术运算会将Series的索引匹配到DataFrame的列，然后沿着行一直向下广播。

如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集。

如果你希望匹配行且在列上广播，则必须使用算术运算方法。

In [29]:
import numpy as np
import pandas as pd

## 逐元素二元运算
记住：

此类运算都是默认以label对齐的；

可以认为相加的两个操作数都是先将index和columns拓展至相同后，再执行运算。

In [30]:
df1 = pd.DataFrame([[1,2],[3,4]], index =['a','b'],columns = ['A','B'])
df1

   A  B
a  1  2
b  3  4

In [31]:
df2 = pd.DataFrame([[3,4],[5,6]], index =['b','c'],columns = ['B','C'])
df2

   B  C
b  3  4
c  5  6

### 加（+）

In [32]:
df1 + df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

    A    B   C
a NaN  NaN NaN
b NaN  7.0 NaN
c NaN  NaN NaN

In [33]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [34]:
df1
s1
df1 + s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

   A  B
a  2  4
b  4  6

### .add( )

add() 比 + 号功能更强，区别提体现在可以控制Series构造的方式。

DataFrame.add(other, axis='columns', fill_value=None)

- other：另一个DataFrame或Series；
- axis：如果other是Series，指定Series的索引去和DataFrame的行匹配，还是和列匹配（+号是默认和列匹配）；
- fill_value：这个参数是指两个DataFrame只有一个值缺失的情况，缺失的值怎么处理。两者都缺失，那么就是NaN。

In [35]:
df1.add(s1, axis = 'columns')  # 和+号功能相同

   A  B
a  2  4
b  4  6

In [36]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [37]:
df1.add(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  2.0  3.0
b  NaN  NaN

### 减（-）

In [38]:
df1 - df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

    A    B   C
a NaN  NaN NaN
b NaN  1.0 NaN
c NaN  NaN NaN

In [39]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [40]:
df1
s1
df1 - s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

   A  B
a  0  0
b  2  2

### 其它运算和加法运算类似---减法 --   sub()

In [41]:
df1.sub(s1, axis = 'columns')  # 和+号功能相同

   A  B
a  0  0
b  2  2

In [42]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [43]:
df1.sub(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  0.0  1.0
b  NaN  NaN

### 乘（ *  ）

In [44]:
df1 * df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

    A     B   C
a NaN   NaN NaN
b NaN  12.0 NaN
c NaN   NaN NaN

In [45]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [46]:
df1
s1
df1 * s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

   A  B
a  1  4
b  3  8

### 其它运算和加法运算类似--乘法	x	mul()

In [47]:
df1.mul(s1, axis = 'columns')  # 和+号功能相同

   A  B
a  1  4
b  3  8

In [48]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [49]:
df1.mul(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  1.0  2.0
b  NaN  NaN

### 除（ / ）

In [50]:
df1 / df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

    A         B   C
a NaN       NaN NaN
b NaN  1.333333 NaN
c NaN       NaN NaN

In [51]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [52]:
df1
s1
df1 / s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

     A    B
a  1.0  1.0
b  3.0  2.0

### 其它运算和加法运算类似除法	/	div()

In [53]:
df1.div(s1, axis = 'columns')  # 和+号功能相同

     A    B
a  1.0  1.0
b  3.0  2.0

In [54]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [55]:
df1.div(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  1.0  2.0
b  NaN  NaN

### 模（ % ）

In [56]:
df1 % df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

    A    B   C
a NaN  NaN NaN
b NaN  1.0 NaN
c NaN  NaN NaN

In [57]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [58]:
df1
s1
df1 % s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

   A  B
a  0  0
b  0  0

### 其它运算和加法运算类似模运算	%	mod()

In [59]:
df1.mod(s1, axis = 'columns')  # 和+号功能相同

   A  B
a  0  0
b  0  0

In [60]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [61]:
df1.mod(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  0.0  0.0
b  NaN  NaN

### 幂运算（ ** ）

In [62]:
df1 ** df2   # df1的'B','b'和df2的'B','b'对上了，其他位置都至少有一个缺失值，此时填NaN

     A     B   C
a  1.0   NaN NaN
b  NaN  64.0 NaN
c  NaN   NaN NaN

In [63]:
s1 = pd.Series([1,2], index =['A','B'], name = 'A')
s1

A    1
B    2
Name: A, dtype: int64

In [64]:
df1
s1
df1 ** s1  # +号默认将Series的index与DataFrame的columns对齐，然后以DataFrame的index为index，纵向复制构造一个DataFrame。
# 也即s1被转化成了：

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

   A   B
a  1   4
b  3  16

### 其它运算和加法运算类似幂运算	**	pow()

In [65]:
df1.pow(s1, axis = 'columns')  # 和+号功能相同

   A   B
a  1   4
b  3  16

In [66]:
s2 = pd.Series([1,2], index =['a','B'])
s2

a    1
B    2
dtype: int64

In [67]:
df1.pow(s2, axis = 'index') 
# s1被转化为：以DataFrame的columns为columns，横向复制

     A    B
B  NaN  NaN
a  1.0  2.0
b  NaN  NaN

## 矩阵运算

pandas是以numpy这个数值代数库为基础的，所以其也支持矩阵操作，虽然它并以此为目的。

###  .dot()

DataFrame.dot(other)

- other：DataFrame或Series

注意，pandas在做矩阵运算时，要求：矩阵的维度相同，左操作数的列索引和右操作数的行索引相同。

In [68]:
df1
df2

   A  B
a  1  2
b  3  4

   B  C
b  3  4
c  5  6

In [69]:
# df1.dot(df2)#报错
df2.index = ['A','B']  
df2

   B  C
A  3  4
B  5  6

In [70]:
df1.dot(df2)  # 左操作数的行索引和右操作数的列索引变为内积后元素的行、列索引

    B   C
a  13  16
b  29  36

In [71]:
df1
s1
df1.dot(s1)

   A  B
a  1  2
b  3  4

A    1
B    2
Name: A, dtype: int64

a     5
b    11
dtype: int64

### .T

矩阵的转置。

In [72]:
df1
df1.T

   A  B
a  1  2
b  3  4

   a  b
A  1  3
B  2  4

## 本地一元变换

这些运算不改变索引，只是在当前位置做一些变化。

### .abs()

转化为绝对值。

In [74]:
df1
df1.loc['a','A'] = -1
df1
df1.abs()

   A  B
a -1  2
b  3  4

   A  B
a -1  2
b  3  4

   A  B
a  1  2
b  3  4

###  .cumxxx()

累计运算，从开始到当前数据结束获取一个值。

DataFrame.cumxxx(axis='index')

- axis：'index'或'columns'
- xxx 可取：max, min, sum, prod

In [75]:
df1
df1.cummax()  # 默认为沿index，列

   A  B
a -1  2
b  3  4

   A  B
a -1  2
b  3  4

In [76]:
df1.cummax(axis = 'columns')  # columns意思，行

   A  B
a -1  2
b  3  4

### .clip()

顾名思义，裁剪也即将数据裁剪到一定范围内。

DataFrame.clip(lower=None, upper=None)

- lower：float
- upper：float

In [81]:
df1 = pd.DataFrame([[-1,1],[-0.4,3]],index=['a','b'],columns=['A','B'])
df1

     A  B
a -1.0  1
b -0.4  3

In [82]:
df1.clip( -0.5,0.5)

     A    B
a -0.5  0.5
b -0.4  0.5

###  .rank()

顾名思义，rank次序的意思，也即标示出数值的次序

DataFrame.rank(axis=0, method='average',  ascending=True, pct=False)

- axis：0（'index'）-按列方向，1('columns')-按行方向
- method：对于值相同的数怎么标记顺序，
- 'first'：所有数按照大小排序，如相同按照出现顺序赋次序。
- 'dense'：值相同为一组，按照组值排序，组内取相同次序，和min不同—min是将相同数用第一
- ascending：True or False，升序还是降序；
- pct：percent，按照百分比显示，将显示的次序除以列、或行元素个数。

In [83]:
df1 = pd.DataFrame(data = [[1,1,2,2],[2,3,2,4]])
df1

   0  1  2  3
0  1  1  2  2
1  2  3  2  4

In [84]:
df1.rank(axis='columns', method='min', pct=False) # 注意和下面 dense 对比

     0    1    2    3
0  1.0  1.0  3.0  3.0
1  1.0  3.0  1.0  4.0

In [85]:
df1.rank(axis='columns', method='dense', pct=False)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  1.0  2.0  1.0  3.0

In [86]:
df1.rank(axis='columns', method='dense', pct=True)  # 按照百分比显示，相当于直接除行元素个数

          0         1         2    3
0  0.500000  0.500000  1.000000  1.0
1  0.333333  0.666667  0.333333  1.0

###  .round()

前面一章介绍了设置显示精度的操作，其不改变实际精度，而这个API则可以改变精度。

- Series.round(decimals=0)
- decimals：控制小数位数

In [88]:
s= pd.Series([1.111,2.222])
s
 
s.round(1)
 
s.round(2)

s.round(3)

0    1.111
1    2.222
dtype: float64

0    1.1
1    2.2
dtype: float64

0    1.11
1    2.22
dtype: float64

0    1.111
1    2.222
dtype: float64